*&---------------------------------------------------------------------*
*& Include          ZGG_R_SOAP_MAIN
*&---------------------------------------------------------------------*

*----------------------------------------------------------------------*
*INITIALIZATION.
*----------------------------------------------------------------------*
INITIALIZATION.
  go_main = NEW #( ) .

  go_main->initialization( ).

*----------------------------------------------------------------------*
*AT SELECTION-SCREEN.
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.

*    AUTHORITY-CHECK OBJECT 'ZGG_AO_01'
*                  ID 'ACTVT' FIELD '02'
*                  ID 'ULKE' FIELD p_ulke.
*
*    IF sy-subrc EQ 0.
*      MESSAGE 'Yetki kontrolü başarıyla geçildi.' TYPE 'S' .
*    ELSE.
*      MESSAGE 'Bu ülke liglerini görüntülemeye yetkiniz yoktur' TYPE 'S' DISPLAY LIKE 'E'.
*      RETURN.
*    ENDIF.

*----------------------------------------------------------------------*
*AT SELECTION-SCREEN OUTPUT.
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.

*----------------------------------------------------------------------*
*START-OF-SELECTION.
*----------------------------------------------------------------------*
START-OF-SELECTION.

  CALL SCREEN 100.

*----------------------------------------------------------------------*
*END-OF-SELECTION.
*----------------------------------------------------------------------*
END-OF-SELECTION.
